package lesson4.conditional;

import java.util.Scanner;

public class Task {
    /*2) Написать программу которая спрашивает у пользователя вопрос:
            "Что вас интересует?".
    Если пользователь вводит с клавиатуры "Profession", то в консоль выводится "Automation Quality Assurance".
    Если пользователь вводит с клавиатуры "Programming language", то в консоль выводится "Java".
    Если пользователь вводит с клавиатуры "Group", то в консоль выводится "QA-7".
    В противном случае в консоль выводится "Information not found... Sorry".*/
        public static void main(String[] args) {
            Scanner keybInput = new Scanner(System.in);
            System.out.println("Что вас интересует?");
            String textIn = keybInput.nextLine();
            if (textIn.equals("Profession")) {
                System.out.println("Automation Quality Assurance");
            } else if (textIn.equals("Programming language")) {
                System.out.println("Java");
            } else if (textIn.equals("Group")) {
                System.out.println("QA-7");

            } else {
                System.out.println("Information not found... Sorry");
            }
        }

    }

